_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 32, 32, 32)        320
_________________________________________________________________
batch_normalization_1 (Batch (None, 32, 32, 32)        128
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 32)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 32, 32, 32)        9248
_________________________________________________________________
batch_normalization_2 (Batch (None, 32, 32, 32)        128
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 32)        0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 16, 16, 32)        0
_________________________________________________________________
dropout_1 (Dropout)          (None, 16, 16, 32)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 64)        18496
_________________________________________________________________
batch_normalization_3 (Batch (None, 16, 16, 64)        256
_________________________________________________________________
activation_3 (Activation)    (None, 16, 16, 64)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 14, 14, 64)        36928
_________________________________________________________________
batch_normalization_4 (Batch (None, 14, 14, 64)        256
_________________________________________________________________
activation_4 (Activation)    (None, 14, 14, 64)        0
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 7, 7, 64)          0
_________________________________________________________________
dropout_2 (Dropout)          (None, 7, 7, 64)          0
_________________________________________________________________
flatten_1 (Flatten)          (None, 3136)              0
_________________________________________________________________
dense_1 (Dense)              (None, 256)               803072
_________________________________________________________________
batch_normalization_5 (Batch (None, 256)               1024
_________________________________________________________________
activation_5 (Activation)    (None, 256)               0
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0
_________________________________________________________________
dense_2 (Dense)              (None, 72)                18504
_________________________________________________________________
batch_normalization_6 (Batch (None, 72)                288
_________________________________________________________________
activation_6 (Activation)    (None, 72)                0
=================================================================
Total params: 888,648
Trainable params: 887,608
Non-trainable params: 1,040
_________________________________________________________________
None
Train on 8294 samples, validate on 922 samples
Epoch 1/10
 - 195s - loss: 3.1783 - acc: 0.2155 - val_loss: 2.8484 - val_acc: 0.2321
Epoch 2/10
 - 185s - loss: 2.1101 - acc: 0.4432 - val_loss: 0.8493 - val_acc: 0.7852
Epoch 3/10
 - 188s - loss: 1.6240 - acc: 0.5493 - val_loss: 0.5684 - val_acc: 0.8427
Epoch 4/10
 - 190s - loss: 1.3386 - acc: 0.6254 - val_loss: 0.3536 - val_acc: 0.9067
Epoch 5/10
 - 189s - loss: 1.1411 - acc: 0.6755 - val_loss: 0.3089 - val_acc: 0.9121
Epoch 6/10
 - 186s - loss: 1.0092 - acc: 0.7122 - val_loss: 0.2271 - val_acc: 0.9469
Epoch 7/10
 - 185s - loss: 0.8479 - acc: 0.7651 - val_loss: 0.1655 - val_acc: 0.9631
Epoch 8/10
 - 184s - loss: 0.7511 - acc: 0.7971 - val_loss: 0.1326 - val_acc: 0.9675
Epoch 9/10
 - 184s - loss: 0.6929 - acc: 0.8126 - val_loss: 0.1670 - val_acc: 0.9631
Epoch 10/10
 - 187s - loss: 0.6203 - acc: 0.8365 - val_loss: 0.1057 - val_acc: 0.9707